---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.KilonewtonMeters
source: html/7500810f-489a-b050-c9d6-0480fb3a4b6e.htm
---
# Autodesk.Revit.DB.UnitTypeId.KilonewtonMeters Property

Kilonewton meters.

## Syntax (C#)
```csharp
public static ForgeTypeId KilonewtonMeters { get; }
```